{
  "backend/main.mo": "Minimal Motoko canister with an empty actor.",
  "feature_evidence.json": "Feature evidence report describing two frontend-related feature requirements and their associated files and components.",
  "frontend-file-summaries.txt": "Prewritten summaries of key frontend files including layout, pages, content config, and styling.",
  "frontend/index.css": "Tailwind base stylesheet defining OKLCH color variables for light and dark modes with global resets.",
  "frontend/index.html": "Basic HTML entry point containing the root div and script loading the React app.",
  "frontend/src/App.tsx": "Configures TanStack Router with routes for all pages and provides the router to the app.",
  "frontend/src/components/layout/SiteFooter.tsx": "Footer showing business name, current year, and caffeine.ai attribution with tracking parameters.",
  "frontend/src/components/layout/SiteHeader.tsx": "Responsive header with logo, business name, tagline, and desktop/mobile navigation menus.",
  "frontend/src/components/layout/SiteLayout.tsx": "Wraps all pages with a consistent header, footer, and main content area.",
  "frontend/src/content/siteContent.ts": "Centralized business info, tagline, service descriptions, highlights, and contact details.",
  "frontend/src/hooks/useActor.ts": "React hook that creates and manages an authenticated or anonymous backend actor, refreshing related queries when identity changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides a React context and provider for Internet Identity authentication using AuthClient, exposing identity state, login, logout, and status flags.",
  "frontend/src/hooks/useQueries.ts": "Empty placeholder file for future React Query hooks; currently no backend methods to implement.",
  "frontend/src/index.css": "Defines Tailwind base styles and custom theme variables for light and dark modes, including color tokens and utilities.",
  "frontend/src/main.tsx": "Bootstraps the React app, wrapping it with QueryClientProvider and InternetIdentityProvider before rendering App.",
  "frontend/src/pages/AboutPage.tsx": "Renders the About page layout using Card components and siteContent fields for story, mission, and approach text.",
  "frontend/src/pages/ContactPage.tsx": "Displays contact methods, location, and business hours using Card components and data from siteContent.",
  "frontend/src/pages/HomePage.tsx": "Builds the homepage with a hero section, highlights list, and business details populated from siteContent.",
  "frontend/src/pages/ServiceDetailsPage.tsx": "Shows detailed information for a selected service using URL params, with fallbacks for missing services.",
  "frontend/src/pages/ServicesPage.tsx": "Lists all services from siteContent with cards linking to their respective detail pages.",
  "frontend/tailwind.config.js": "Tailwind configuration enabling dark mode, defining content paths, extending theme colors, animations, and shadows, and registering typography, container query, and animation plugins.",
  "project_state.json": "Project metadata describing the business website’s purpose, content requirements, issues with logo rendering and deployment, and existing feature implementations."
}